Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  /* TPU Encoder clock inputs (rear wheels) */
  k_pin_enc2_pha = k_rx_pc_2, /**< PC.2 - TCLKA (encoder 2 phase A) */
  k_pin_enc2_phb = k_rx_pa_3, /**< PA.3 - TCLKB (encoder 2 phase B) */
  k_pin_enc3_pha = k_rx_pc_0, /**< PC.0 - TCLKC (encoder 3 phase A) */
  k_pin_enc3_phb = k_rx_pb_3, /**< PB.3 - TCLKD (encoder 3 phase B) */

  /* GPTW PWM outputs (4 motors x 2 pins = IN2 + IN1, distributed across ports) */
  k_pin_motor0_in2 = k_rx_p2_3, /**< P2.3 - GTIOC0A (motor 0 IN2/direction, pin 34) */
  k_pin_motor0_in1 = k_rx_p1_7, /**< P1.7 - GTIOC0B (motor 0 IN1/PWM, pin 38) */
  k_pin_motor1_in2 = k_rx_p2_2, /**< P2.2 - GTIOC1A (motor 1 IN2/direction, pin 35) */
  k_pin_motor1_in1 = k_rx_pc_3, /**< PC.3 - GTIOC1B (motor 1 IN1/PWM, pin 67) */
  k_pin_motor2_in2 = k_rx_pe_3, /**< PE.3 - GTIOC2A (motor 2 IN2/direction, pin 108) */
  k_pin_motor2_in1 = k_rx_p8_6, /**< P8.6 - GTIOC2B (motor 2 IN1/PWM, pin 41) */
  k_pin_motor3_in2 = k_rx_pe_7, /**< PE.7 - GTIOC3A (motor 3 IN2/direction, pin 101) */
  k_pin_motor3_in1 = k_rx_pc_6, /**< PC.6 - GTIOC3B (motor 3 IN1/PWM, pin 61) */

  /* IMU (RIIC1 I2C + GPIO) */
  k_pin_imu_scl = k_rx_p2_1, /**< P2.1 - SCL1 (IMU I2C clock, pin 36) */
  k_pin_imu_sda = k_rx_p2_0, /**< P2.0 - SDA1 (IMU I2C data, pin 37) */
  k_pin_imu_int = k_rx_p3_2, /**< P3.2 - IMU interrupt (active-low, pin 27) */
  k_pin_imu_rst = k_rx_p8_3, /**< P8.3 - IMU reset (active-low, pin 58) */

  /* DRV8263H DRVOFF pins (GPIO output, initial HIGH = outputs disabled) */
  k_pin_motor0_drvoff = k_rx_p6_1, /**< P6.1 - Motor 0 DRVOFF (pin 115) */
  k_pin_motor1_drvoff = k_rx_p6_3, /**< P6.3 - Motor 1 DRVOFF (pin 113) */
  k_pin_motor2_drvoff = k_rx_pe_0, /**< PE.0 - Motor 2 DRVOFF (pin 111) */
  k_pin_motor3_drvoff = k_rx_pe_2, /**< PE.2 - Motor 3 DRVOFF (pin 109) */

  /* DRV8263H nSLEEP pins (GPIO output, initial HIGH = awake) */
  k_pin_motor0_nsleep = k_rx_p6_0, /**< P6.0 - Motor 0 nSLEEP (pin 117) */
  k_pin_motor1_nsleep = k_rx_p6_2, /**< P6.2 - Motor 1 nSLEEP (pin 114) */
  k_pin_motor2_nsleep = k_rx_p6_4, /**< P6.4 - Motor 2 nSLEEP (pin 112) */
  k_pin_motor3_nsleep = k_rx_pe_1, /**< PE.1 - Motor 3 nSLEEP (pin 110) */

  /* ADC current sense (S12AD0, AN004-AN007) */
  k_pin_adc_an004 = k_rx_p4_4, /**< P4.4 - AN004 (motor 3 current) */
  k_pin_adc_an005 = k_rx_p4_5, /**< P4.5 - AN005 (motor 2 current) */
  k_pin_adc_an006 = k_rx_p4_6, /**< P4.6 - AN006 (motor 1 current) */
  k_pin_adc_an007 = k_rx_p4_7, /**< P4.7 - AN007 (motor 0 current) */
} rx_mpc_pin_t;

/**
 * @enum gpio_pin_counts_t
 * @brief Static array-size and loop-bound constants for GPIO pin groups
 *
 * @details
 * Provides compile-time upper bounds for all GPIO pin arrays. Used as loop
 * limits in internal_gpio_init_*() helpers and as array-size declarators.
 *
 * @invariant All values must fit in uint8_t (loop counter type)
 *
 * @code{.c}
 * const rx_port_pin_t pins[k_gptw_pin_count] = { ... };
 * for (uint8_t i = 0; i < k_gptw_pin_count; i++) {
 *     rx_mpc_set_gptw(pins[i]);
 * }
 * @endcode
 *
 * @see internal_gpio_init_gptw_pwm() Uses k_gptw_pin_count
 * @see internal_gpio_init_motor_driver_ctrl() Uses k_motor_count
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_gptw_pin_count = 8, /**< 4 motors x 2 pins (IN2 + IN1) */
  k_motor_count    = 4, /**< 4 DRV8263H motor drivers */
  k_sonar_count    = 4, /**< 4 HC-SR04 ultrasonic sensors */
} gpio_pin_counts_t;

/** @brief GPTW PWM frequency constant */
typedef enum : uint32_t {
  k_gptw_pwm_freq_hz = 20000, /**< 20 kHz PWM frequency */
} gptw_freq_t;

/** @brief GPTW dead-time constant */
typedef enum : uint16_t {
  k_gptw_deadtime_ns = 1000, /**< 1 us dead-time between complementary outputs */
} gptw_deadtime_t;

/* RSPI channel: use k_rspi_channel_2 from hardware.h for host SPI peripheral */

/**
 * @enum i2c_channel_t
 * @brief I2C channel assignments for RX72N RIIC peripherals
 *
 * @details
 * Maps logical I2C bus roles to physical RIIC channel numbers.
 * RIIC0 is the host-side channel used for RPi5 communication.
 * RIIC1 is the IMU channel shared by BNO055 and BMP280.
 *
 * @invariant k_i2c_channel_0 != k_i2c_channel_1 (distinct physical channels)
 * @invariant Values map 1:1 to RIIC peripheral indices in the RX72N register map
 *
 * @see i2c_freq_t Corresponding frequency constants per channel
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_i2c_channel_0 = 0, /**< RIIC0 = host I2C (RPi5 comms) */
  k_i2c_channel_1 = 1, /**< RIIC1 = IMU I2C (BNO055 + BMP280) */
} i2c_channel_t;
static_assert((bool)(k_i2c_channel_0 != k_i2c_channel_1),
              "I2C channel assignments must be distinct");

/**
 * @enum i2c_freq_limits_t
 * @brief Valid I2C frequency range constants for RIIC channel validation
 *
 * @details
 * Defines the minimum and maximum allowed I2C frequencies for compile-time
 * assertions. The maximum is the I2C fast mode upper bound (400 kHz). Used
 * to replace raw numeric literals in static_assert checks.
 *
 * @invariant k_i2c_freq_min_hz > 0 (non-zero)
 * @invariant k_i2c_fast_mode_max_hz == 400000 (I2C fast mode specification)
 *
 * @see i2c_freq_t Channel frequency assignments validated against these limits
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_i2c_freq_min_hz      = 1U,      /**< Minimum valid I2C frequency (must be > 0) */
  k_i2c_fast_mode_max_hz = 400000U, /**< I2C fast mode maximum frequency (400 kHz) */
} i2c_freq_limits_t;

/**
 * @enum i2c_freq_t
 * @brief I2C bus frequency constants for each RIIC channel
 *
 * @details
 * Both host and IMU channels operate at 400 kHz (I2C fast mode).
 * The BNO055 and BMP280 sensors both support up to 400 kHz.
 * The RPi5 host interface also uses 400 kHz for maximum throughput.
 *
 * @invariant All frequency values >= k_i2c_freq_min_hz and <= k_i2c_fast_mode_max_hz
 * @invariant Values are stable hardware constants; never modified at runtime
 *
 * @see i2c_channel_t Channel assignments these frequencies apply to
 * @see i2c_freq_limits_t Valid frequency range
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_i2c_host_freq_hz = k_i2c_fast_mode_max_hz, /**< 400 kHz fast mode for host (RIIC0) */
  k_i2c_imu_freq_hz  = k_i2c_fast_mode_max_hz, /**< 400 kHz fast mode for IMU sensors (RIIC1) */
} i2c_freq_t;
static_assert((bool)((unsigned int)k_i2c_host_freq_hz >= (unsigned int)k_i2c_freq_min_hz),
              "Host I2C frequency must be non-zero");
static_assert((bool)((unsigned int)k_i2c_imu_freq_hz >= (unsigned int)k_i2c_freq_min_hz),
              "IMU I2C frequency must be non-zero");

