Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  /* IMU I2C (RIIC1): SCL1 + SDA1 */
  rx_err_t err = rx_mpc_set_riic((rx_port_pin_t)k_pin_imu_scl);
  RX_RETURN_ON_ERROR(err, s_tag, "SCL1 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_imu_sda);
  RX_RETURN_ON_ERROR(err, s_tag, "SDA1 pin config failed");

  /* IMU RST: GPIO output, initial HIGH (not in reset) */
  err = rx_mpc_set_gpio((rx_port_pin_t)k_pin_imu_rst);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU RST MPC config failed");

  internal_gpio_set_output((rx_port_pin_t)k_pin_imu_rst, true); /* HIGH = not in reset */

  return k_rx_ok;
}

/**
 * @enum imu_irq_cfg_t
 * @brief ICU configuration constants for the IMU INT (IRQ12) interrupt
 *
 * @details
 * P3.2 is connected to the BNO055 INT pin (active-low, falling-edge).
 * IRQ12 vector = 64 (IRQ0 base) + 12 = 76.
 * IER index = 76 / 8 = 9, bit = 76 % 8 = 4.
 *
 * Priority 7 sits between the comm task ISR (priority 6) and motor control (8).
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_imu_irq_num        = 12U,   /**< IRQ number for P3.2 (BNO055 INT pin) */
  k_irqcr_falling_edge = 0x04U, /**< IRQCR[n] bits[3:2]=01: falling-edge trigger */
  k_icu_ir_clear_imu   = 0U,    /**< Write 0 to IR register to clear pending flag */
  k_imu_irq_priority   = 7U,    /**< IPR priority (between comm=6 and motor=8) */
  k_imu_ier_bits       = 8U,    /**< Bits per IER register (vector/8 = IER index) */
} imu_irq_cfg_t;

/**
 * @enum imu_irq_vector_t
 * @brief ICU vector number for IRQ12 (IMU INT on P3.2)
 *
 * @details
 * External IRQ0 = vector 64; IRQ12 = 64 + 12 = 76.
 * Stored in uint8_t (fits in 0-255 range).
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_imu_irq_vector = 76U, /**< ICU vector for IRQ12: 64 (IRQ0 base) + 12 */
} imu_irq_vector_t;

/**
 * @brief Configure IMU INT pin (P3.2) as falling-edge IRQ12 input
 *
 * @details
 * Reconfigures P3.2 from plain GPIO input to IRQ12 function, enabling
 * hardware falling-edge detection on the BNO055 active-low INT signal.
 *
 * Configuration sequence:
 * 1. Set MPC ISEL bit (rx_mpc_set_irq) to route pin to ICU
 * 2. Set GPIO direction to input (direction register cleared)
 * 3. Enable digital noise filter (PCLK/32 = 1.6 us, rejects < 1 us spikes)
 * 4. Set IRQCR[12] = 0x04 (falling-edge mode: bits[3:2] = 01)
 * 5. Set IPR[76] = 7 (priority 7, between comm and motor tasks)
 * 6. Clear IR[76] (remove any stale pending request)
 * 7. Enable in IER[9] bit 4 (vector 76 / 8 = 9, 76 % 8 = 4)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok IRQ12 configured successfully
 * @retval k_rx_err_hw_init_failed MPC or filter configuration failed
 *
 * @pre P3.2 not in use by another peripheral
 * @pre MPC write protection disabled (handled by rx_mpc_set_irq)
 * @post P3.2 configured as IRQ12 input, falling-edge trigger
 * @post Digital noise filter active (PCLK/32, 1.6 us response time)
 * @post ICU enabled for IRQ12 at priority 7
 * @post imu_task.c ISR will fire on each active-low assertion from BNO055
 *
 * @note Called during single-threaded hardware_init() before RTOS start
 * @note The ISR (INT_IRQ12 in imu_task.c) sets s_imu_event_flags
 * @warning Do not call after RTOS starts; ICU register access is not thread-safe
 *
 * @see rx_mpc_set_irq() MPC ISEL bit configuration for IRQ function
 * @see rx_irq_filter_enable() Digital noise filter API
 * @see imu_task.c INT_IRQ12() ISR handler (sets event flags)
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_imu_irq(void)
{
  static const char* s_tag = "GPIO_IMU_IRQ";

  /* NASA Rule 5: precondition validation */
  RX_ASSERT(rx_port_get_base(rx_port_from_pin((rx_port_pin_t)k_pin_imu_int)) != nullptr,
            "IMU INT port base invalid");

  /* Step 1: Configure P3.2 for IRQ12 function (MPC ISEL bit set) */
  rx_err_t err = rx_mpc_set_irq((rx_port_pin_t)k_pin_imu_int);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU INT MPC IRQ config failed");

  /* Step 2: Set GPIO direction to input */
  internal_gpio_set_input((rx_port_pin_t)k_pin_imu_int);

  /* Step 3: Enable digital noise filter on IRQ12 (PCLK/32 = 1.6 us response) */
  err = rx_irq_filter_enable(k_imu_irq_num, k_irq_filter_pclk_32);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU INT filter enable failed");

  volatile rx_icu_regs_t* const icu_regs = icu();

  /* Step 4: Falling-edge trigger: IRQCR[12] bits[3:2] = 01 = 0x04 */
  icu_regs->irqcr[k_imu_irq_num] = k_irqcr_falling_edge;

  /* Step 5: Set priority (7 = between comm ISR priority 6 and motor 8) */
  icu_regs->ipr[k_imu_irq_vector] = k_imu_irq_priority;

  /* Step 6: Clear any stale pending request before enabling */
  icu_regs->ir[k_imu_irq_vector] = k_icu_ir_clear_imu;

  /* Step 7: Enable IRQ12 in IER register (IER[9] bit 4) */
  const uint8_t ier_idx = (uint8_t)(k_imu_irq_vector / k_imu_ier_bits);
  const uint8_t ier_bit = (uint8_t)(k_imu_irq_vector % k_imu_ier_bits);
  icu_regs->ier[ier_idx] |= (uint8_t)(1U << ier_bit);

  rx_log_info(s_tag, "IMU IRQ12 configured: P3.2 falling-edge, priority 7");
  return k_rx_ok;
}

/**
 * @brief Configure HOST_IRQ output pin (P67, active-low data-ready signal to RPi5)
 *
 * @details
 * Configures P6.7 (pin 98) as a GPIO output, initialised HIGH (deasserted).
 * The telemetry task drives this pin LOW immediately before each telemetry
 * send and HIGH again after the send completes, giving the RPi5 a hardware
 * data-ready interrupt instead of requiring fixed-rate polling.
 *
 * | Signal   | Pin | Direction | Active Level | Default |
 * |----------|-----|-----------|--------------|---------|
 * | HOST_IRQ | P67 | Output    | LOW          | HIGH    |
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Pin configured successfully
 * @retval k_rx_err_hw_init_failed MPC GPIO configuration failed
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre P6.7 not in use by another peripheral
 * @post P6.7 configured as GPIO output, driven HIGH (deasserted, no data pending)
 * @post RPi5 sees HOST_IRQ HIGH (idle/no-data state)
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during single-threaded initialization before RTOS start.
 *
 * @see telemetry_task.c internal_build_and_send_telemetry() Asserts/deasserts at runtime
 * @see rx_port_constants.h k_rx_p6_7 for the combined port/pin constant
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_host_irq(void)
{
  static const char* s_tag = "GPIO_IRQ";

  rx_err_t err = rx_mpc_set_gpio((rx_port_pin_t)k_pin_host_irq);
  RX_RETURN_ON_ERROR(err, s_tag, "HOST_IRQ MPC config failed");

  /* Initial HIGH = deasserted (no data pending) */
  internal_gpio_set_output((rx_port_pin_t)k_pin_host_irq, true);

