Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  return k_rx_ok;
}

/**
 * @brief Configure DRV8263H motor driver control pins (DRVOFF + nSLEEP)
 *
 * @details
 * Configures 8 GPIO output pins for DRV8263H motor driver control:
 * - 4x DRVOFF pins: Output HIGH (driver outputs disabled for safe startup)
 * - 4x nSLEEP pins: Output HIGH (driver awake, not in sleep mode)
 *
 * ## Safe Initialization Order (Critical)
 *
 * DRVOFF pins are configured **before** nSLEEP pins. This ordering is
 * required by the DRV8263H power-up sequence:
 *
 * 1. DRVOFF = HIGH first  -> H-bridge outputs disabled (safe state)
 * 2. nSLEEP = HIGH second -> driver wakes up with outputs already disabled
 *
 * If nSLEEP were asserted first (waking the driver), the H-bridge outputs
 * could briefly be in an undefined state before DRVOFF is driven HIGH,
 * risking uncontrolled motor movement or shoot-through.
 *
 * Motor outputs remain disabled (DRVOFF=HIGH) until the motor control task
 * explicitly drives DRVOFF LOW before commanding PWM.
 * @todo (#367) Motor control task must drive DRVOFF LOW before commanding PWM.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 8 pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post All 4 DRVOFF pins configured as GPIO outputs, driven HIGH (disabled)
 * @post All 4 nSLEEP pins configured as GPIO outputs, driven HIGH (awake)
 *
 * @note Not thread-safe. Performs non-atomic RMW on port registers.
 * @note Called only during single-threaded initialization before RTOS start.
 *
 * @warning DRVOFF must be driven HIGH before nSLEEP is asserted to prevent
 *          uncontrolled H-bridge output during driver wake-up.
 *
 * @see internal_gpio_set_output() Used for all DRVOFF and nSLEEP pins
 * @see rx_mpc_set_gpio() MPC configuration for GPIO mode
 * @see internal_gpio_init_gptw_pwm() Configures PWM pins for DRV8263H IN1/IN2
 *
 * @since Version 1.0.0
 */
/** @brief Configure all DRVOFF GPIO pins as outputs HIGH (outputs disabled). */
static rx_err_t internal_gpio_init_drvoff_pins(const rx_port_pin_t pins[])
{
  static const char* s_tag = "GPIO_DRV_CTRL";
  for (uint8_t i = 0; i < k_motor_count; i++) {
    const rx_err_t err = rx_mpc_set_gpio(pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "DRVOFF MPC config failed");
    internal_gpio_set_output(pins[i], true); /* HIGH = outputs disabled */
  }
  return k_rx_ok;
}

/** @brief Configure all nSLEEP GPIO pins as outputs HIGH (driver awake). */
static rx_err_t internal_gpio_init_nsleep_pins(const rx_port_pin_t pins[])
{
  static const char* s_tag = "GPIO_DRV_CTRL";
  for (uint8_t i = 0; i < k_motor_count; i++) {
    const rx_err_t err = rx_mpc_set_gpio(pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "nSLEEP MPC config failed");
    internal_gpio_set_output(pins[i], true); /* HIGH = awake */
  }
  return k_rx_ok;
}

static rx_err_t internal_gpio_init_motor_driver_ctrl(void)
{
  static const char* s_tag = "GPIO_DRV_CTRL";

  /* NASA Rule 5: precondition validation */
  RX_ASSERT(rx_port_get_base(rx_port_from_pin((rx_port_pin_t)k_pin_motor0_drvoff)) != nullptr,
            "Motor 0 DRVOFF port base invalid");
  RX_ASSERT(rx_port_get_base(rx_port_from_pin((rx_port_pin_t)k_pin_motor0_nsleep)) != nullptr,
            "Motor 0 nSLEEP port base invalid");

  const rx_port_pin_t drvoff_pins[k_motor_count] = {(rx_port_pin_t)k_pin_motor0_drvoff,
                                                    (rx_port_pin_t)k_pin_motor1_drvoff,
                                                    (rx_port_pin_t)k_pin_motor2_drvoff,
                                                    (rx_port_pin_t)k_pin_motor3_drvoff};

  const rx_port_pin_t nsleep_pins[k_motor_count] = {(rx_port_pin_t)k_pin_motor0_nsleep,
                                                    (rx_port_pin_t)k_pin_motor1_nsleep,
                                                    (rx_port_pin_t)k_pin_motor2_nsleep,
                                                    (rx_port_pin_t)k_pin_motor3_nsleep};

  /* CRITICAL ORDERING: DRVOFF HIGH before nSLEEP HIGH to prevent undefined
   * H-bridge state during wake-up (per DRV8263H datasheet sec 7.3.1) */
  rx_err_t err = internal_gpio_init_drvoff_pins(drvoff_pins);
  RX_RETURN_ON_ERROR(err, s_tag, "DRVOFF pins init failed");

  err = internal_gpio_init_nsleep_pins(nsleep_pins);
  RX_RETURN_ON_ERROR(err, s_tag, "nSLEEP pins init failed");

  /* Wait for DRV8263H-Q1 tWAKE (~1.2 ms min; busy-wait ~10 ms pre-kernel) */
  internal_busy_wait_us(k_twake_busy_wait_us, k_twake_cpu_mhz);

  return k_rx_ok;
}

/**
 * @brief Configure ADC current sense input pins
 *
 * @details
 * Configures MPC pin multiplexing for S12AD0 analog inputs AN004-AN007 on
 * P4.4-P4.7. Disables digital input buffers and sets pins to analog mode for
 * motor current sensing.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P4.4-P4.7 configured as AN004-AN007 analog inputs
 * @post ADC pins ready for current sensing
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_adc(void)
{
  static const char* s_tag = "GPIO_ADC";

  rx_err_t err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an004);
  RX_RETURN_ON_ERROR(err, s_tag, "AN004 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an005);
  RX_RETURN_ON_ERROR(err, s_tag, "AN005 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an006);
  RX_RETURN_ON_ERROR(err, s_tag, "AN006 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an007);
  RX_RETURN_ON_ERROR(err, s_tag, "AN007 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure USB VBUS detection pin
 *
 * @details
 * Configures MPC pin multiplexing for USB0_VBUS detection on P1.6.
 * Enables USB peripheral to detect host connection via VBUS voltage level.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P1.6 configured as USB0_VBUS input
 * @post USB VBUS detection enabled
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_usb(void)
{
  static const char* s_tag = "GPIO_USB";

  rx_err_t err = rx_mpc_set_usb_vbus((rx_port_pin_t)k_pin_usb_vbus);
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin config failed");

