Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  return k_rx_ok;
}

/** @brief Configure motor, IMU, ADC, USB, and sonar GPIO pins (second half of gpio_init). */
static rx_err_t internal_gpio_init_motor_and_sensors(void)
{
  static const char* s_tag = "GPIO";

  rx_err_t err = internal_gpio_init_gptw_pwm();
  RX_RETURN_ON_ERROR(err, s_tag, "GPTW PWM pin init failed");

  err = internal_gpio_init_motor_driver_ctrl();
  RX_RETURN_ON_ERROR(err, s_tag, "Motor driver control pin init failed");

  err = internal_gpio_init_imu();
  RX_RETURN_ON_ERROR(err, s_tag, "IMU pin init failed");

  err = internal_gpio_init_imu_irq();
  RX_RETURN_ON_ERROR(err, s_tag, "IMU IRQ pin init failed");

  err = internal_gpio_init_adc();
  RX_RETURN_ON_ERROR(err, s_tag, "ADC pin init failed");

  err = internal_gpio_init_usb();
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin init failed");

  err = internal_gpio_init_sonar_triggers();
  RX_RETURN_ON_ERROR(err, s_tag, "Sonar trigger pin init failed");

  err = internal_gpio_init_sonar_echoes();
  RX_RETURN_ON_ERROR(err, s_tag, "Sonar echo pin init failed");

  return k_rx_ok;
}

static rx_err_t gpio_init(void)
{
  static const char* s_tag = "GPIO";

  rx_err_t err = internal_gpio_init_comm_and_encoders();
  RX_RETURN_ON_ERROR(err, s_tag, "Comm and encoder pin init failed");

  err = internal_gpio_init_motor_and_sensors();
  RX_RETURN_ON_ERROR(err, s_tag, "Motor and sensor pin init failed");

  /* GTETRG nFAULT pins: no MPC config needed (documented in header) */
  rx_log_info(s_tag, "GPIO pin muxing complete");

  return k_rx_ok;
}

/**
 * @brief Initialize GPTW PWM for 4 motor channels with 90-degree phase staggering
 *
 * @details
 * Configures GPTW channels 0-3 for complementary PWM output at 20 kHz with
 * 1 us dead-time. Channels are phase-staggered by 90 degrees to reduce peak
 * current draw and EMI.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 4 GPTW channels initialized successfully
 * @retval k_rx_err_hw_init_failed GPTW staggered init failed
 *
 * @pre GPIO pins for GPTW configured via gpio_init() (PSEL = 0x1E)
 * @pre PCLKA clock running at 120 MHz
 *
 * @post 4 GPTW channels configured for 20 kHz complementary PWM
 * @post Phase staggering active (0, 90, 180, 270 degrees)
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rx_gptw_init_all_staggered() HAL function for staggered PWM init
 *
 * @since Version 1.0.0
 */
static rx_err_t gptw_pwm_init(void)
{
  static const char* s_tag = "GPTW";

  /* Per-channel configs: shared frequency / wave mode, distinct pins
   * per motor. Pin map decoded from hardware.h's packed k_pin_motor*
   * constants via rx_port_from_pin / rx_pin_from_pin so the HAL itself
   * never embeds a board-specific pin assumption. */
  const rx_port_pin_t in2_pins[k_rx_gptw_channel_count] = {
    (rx_port_pin_t)k_pin_motor0_in2, (rx_port_pin_t)k_pin_motor1_in2,
    (rx_port_pin_t)k_pin_motor2_in2, (rx_port_pin_t)k_pin_motor3_in2,
  };
  const rx_port_pin_t in1_pins[k_rx_gptw_channel_count] = {
    (rx_port_pin_t)k_pin_motor0_in1, (rx_port_pin_t)k_pin_motor1_in1,
    (rx_port_pin_t)k_pin_motor2_in1, (rx_port_pin_t)k_pin_motor3_in1,
  };

  rx_gptw_config_t configs[k_rx_gptw_channel_count];
  for (uint8_t i = 0; i < k_rx_gptw_channel_count; i++) {
    configs[i] = (rx_gptw_config_t){
      .frequency_hz         = k_gptw_pwm_freq_hz,
      .deadtime_ns          = k_gptw_deadtime_ns,
      .wave_mode            = k_gptw_wave_saw_pwm,
      .enable_complementary = true,
      .invert_polarity      = false,
      .port_a_idx           = rx_port_from_pin(in2_pins[i]),
      .bit_a                = rx_pin_from_pin(in2_pins[i]),
      .port_b_idx           = rx_port_from_pin(in1_pins[i]),
      .bit_b                = rx_pin_from_pin(in1_pins[i]),
    };
  }
  const rx_gptw_config_t* config_ptrs[k_rx_gptw_channel_count] = {
    &configs[0], &configs[1], &configs[2], &configs[3]
  };

  rx_err_t err = rx_gptw_init_all_staggered(config_ptrs);
  RX_RETURN_ON_ERROR(err, s_tag, "GPTW staggered init failed");

  rx_log_info(s_tag, "4 channels @ 20kHz, 90-deg stagger");
  return k_rx_ok;
}

/**
 * @brief Initialize RSPI2 as SPI peripheral for RPi5 host communication
 *
 * @details
 * Configures RSPI2 in peripheral mode for receiving commands from the
 * Raspberry Pi 5 host controller. Uses SPI mode 0 (CPOL=0, CPHA=0) with
 * 8-bit transfers.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok RSPI2 peripheral initialized successfully
 * @retval k_rx_err_hw_init_failed RSPI2 init failed
 *
 * @pre GPIO pins for RSPI2 configured via gpio_init()
 * @pre PCLKA clock running
 *
 * @post RSPI2 ready to receive SPI transactions from RPi5
 * @post SPI mode 0, 8-bit transfers configured
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rspi_init_peripheral() HAL function for RSPI peripheral mode
 *
 * @since Version 1.0.0
 */
static rx_err_t spi_init(void)
{
  static const char* s_tag = "SPI";

  rspi_config_t host_config = {.spi_mode = k_rspi_mode_0, .use_16bit = false};

  rx_err_t err = rspi_init_peripheral(k_rspi_channel_2, &host_config);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 peripheral init failed");

  rx_log_info(s_tag, "RSPI2 initialized (host peripheral, mode 0, 8-bit)");
  return k_rx_ok;
}

/**
 * @brief Initialize I2C buses for host communication and IMU sensors
 *
 * @details
 * Configures two RIIC channels:
 * - **RIIC0** at 400 kHz (fast mode) for RPi5 host I2C (P1.2 SCL0, P1.3 SDA0)
 * - **RIIC1** at 400 kHz (fast mode) for IMU sensors BNO055 + BMP280 (P2.1 SCL1, P2.0 SDA1)
 *
 * GPIO pins for RIIC0 are configured in internal_gpio_init_i2c(); pins for
 * RIIC1 (IMU) are configured in internal_gpio_init_imu().
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Static assertions passed; RIIC init deferred to bus manager
 *
 * @pre GPIO pins for RIIC0 configured via internal_gpio_init_i2c()
 * @pre GPIO pins for RIIC1 (IMU) configured via internal_gpio_init_imu()
 * @pre PCLKB clock running at 60 MHz
 *
 * @post Static frequency assertions verified at compile time
 * @post RIIC initialization deferred to rx_bus_i2c_init() in bus manager
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rx_bus_i2c_init() Performs RIIC channel init on first bus registration
 * @see internal_gpio_init_imu() Configures P2.0/P2.1 for RIIC1
 *
 * @since Version 1.0.0
 */
static rx_err_t i2c_init(void)
{
  static const char* s_tag = "I2C";

