Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  /* 1. GPIO: Configure MPC pin multiplexing for all peripherals */
  rx_err_t err = gpio_init();
  RX_RETURN_ON_ERROR(err, s_tag, "GPIO initialization failed");

  /* 2. GPTW: 4-channel motor PWM with phase staggering */
  err = gptw_pwm_init();
  RX_RETURN_ON_ERROR(err, s_tag, "GPTW PWM initialization failed");

  /* 2b. POEG: Motor fault protection (links GTETRG->POEG->GPTW) */
  err = rx_poeg_init();
  RX_RETURN_ON_ERROR(err, s_tag, "POEG fault protection init failed");

  /* 3. Timer: CMT0 for ThreadX tick (1 kHz) */
  err = timer_init();
  if (rx_err_is_error(err)) {
    return err;
  }

  /* 4. UART: SCI9 debug console - MOVED TO MAIN()
   *    UART initialized in main() before hardware_init() to enable early error logging.
   *    Error logging is now available for all peripheral initialization below. */

  /* 5a. SPI: RSPI2 host peripheral for RPi5 communication */
  err = spi_init();
  RX_RETURN_ON_ERROR(err, s_tag, "SPI initialization failed");

  /* 6. I2C: RIIC0 host */
  err = i2c_init();
  RX_RETURN_ON_ERROR(err, s_tag, "I2C initialization failed");

  /* 7. ADC: S12AD0 channels AN004-AN007 for motor current sensing */
  err = adc_init_channels();
  RX_RETURN_ON_ERROR(err, s_tag, "ADC initialization failed");

  /* 9. Validate: Non-fatal peripheral checks (log warnings, never halt) */
  validate_peripherals();

  return k_rx_ok;
}
#endif /* !RX_IS_SIMULATOR */

rx_err_t hardware_init(void)
{
  /* Precondition: Verify that system clocks have been initialized */
  RX_ASSERT((system_regs() != nullptr) && (system_regs()->sckcr3 != s_sckcr3_reset_state),
            "Precondition: Clock system not properly initialized");

#if !RX_IS_SIMULATOR
  /* Initialize all peripherals: GPIO -> GPTW -> POEG -> Timer -> SPI -> I2C -> ADC */
  const rx_err_t init_err = internal_init_all_peripherals();
  if (rx_err_is_error(init_err)) {
    return init_err;
  }
#endif

  /* Postcondition: Verify clock system is still operational after all setup */
  RX_ASSERT((system_regs() != nullptr) && (system_regs()->sckcr3 != s_sckcr3_reset_state),
            "Postcondition: Clock system corrupted during initialization");

  return k_rx_ok;
}
